{
    "title": "Приложения для симуляции игры в онлайн казино",
    "searchResultTitle": "Кулин Егор",
    "pageName": "lecture",
    "pageMode": "KulinEgor",
    "itemList": [
      {
        "type": "Эскиз",
        "title": "Приложение для симуляции игры в онлайн казино",
        "picture": "img/app/KulinEgor.png"
      },
      {},
      {
        "type": "История",
        "title": "Мне, как пользователю, нужна возможность выбора игрового автомата для начала игры."
      },
      {
        "type": "История",
        "title": "Мне, как пользователю, нужна возможность изменения ставки для управления рисками."
      },
      {
        "type": "История",
        "title": "Мне, как пользователю, нужна возможность просмотра текущего баланса для контроля расходов."
      },
      {
        "type": "История",
        "title": "Мне, как пользователю, нужна возможность запуска автоматической игры для упрощения процесса."
      },
      {
        "type": "История",
        "title": "Мне, как пользователю, нужна возможность покупки бонусной игры для увеличения шансов на выигрыш."
      },
      {},
      {
        "type": "История",
        "title": "Мне, как администратору, нужна возможность добавления новых игровых автоматов для расширения ассортимента."
      },
      {
        "type": "История",
        "title": "Мне, как администратору, нужна возможность изменения коэффициентов выплат для управления доходностью."
      },
      {
        "type": "История",
        "title": "Мне, как администратору, нужна возможность управления пользователями для обеспечения безопасности."
      },
      {
        "type": "История",
        "title": "Мне, как администратору, нужна возможность просмотра статистики игр для анализа популярности."
      },
      {
        "type": "История",
        "title": "Мне, как администратору, нужна возможность настройки интерфейса для улучшения пользовательского опыта."
      },
      {},
      {
        "type": "История",
        "title": "Мне, как разработчику, нужна функция запуска игрового автомата (startSlotMachine) для ее вызова из главной функции."
      },
      {
        "type": "История",
        "title": "Мне, как разработчику, нужна функция изменения ставки (changeBet) для ее вызова из обработчика события нажатия кнопки изменения ставки."
      },
      {
        "type": "История",
        "title": "Мне, как разработчику, нужна функция обновления баланса (updateBalance) для ее вызова после каждой игры."
      },
      {
        "type": "История",
        "title": "Мне, как разработчику, нужна функция запуска автоматической игры (startAutoPlay) для ее вызова из обработчика события нажатия кнопки автоповтора."
      },
      {
        "type": "История",
        "title": "Мне, как разработчику, нужна функция покупки бонусной игры (buyBonusGame) для ее вызова из обработчика события нажатия кнопки покупки."
      }
    ]
  }